import 'package:places/domain/sight.dart';

final List<Sight> mocks = <Sight>[
  Sight(
      name: 'Смотровая площадка «Семь ветров»',
      lat: 44.725662287326365,
      lon: 37.867255241955114,
      url:
          'https://www.tripadvisor.ru/Attraction_Review-g660729-d6429400-Reviews-Observation_deck_7_winds-Novorossiysk_Krasnodar_Krai_Southern_District.html',
      details:
          '''Площадка находится на Андреевском перевале. Отсюда открывается завораживающий вид на город, море, горы и живописные окружающие пейзажи. Раньше здесь работал ресторан с одноименным названием, с которым связаны страшные истории о призраке девушки, якобы убитой отвергнутым ухажером прямо на собственной свадьбе. Некоторые жители говорят, что «видели» ее призрак на перевале''',
      type: 'Культурные объекты и достопримечательности'),
  Sight(
    name: 'Озера Абрау',
    lat: 44.700292323276116,
    lon: 37.59190615885557,
    url:
        'https://www.tripadvisor.ru/Attraction_Review-g660729-d7240720-Reviews-Lake_Abrau-Novorossiysk_Krasnodar_Krai_Southern_District.html',
    details:
        'Большое пресноводное озеро примерно в 14 км. от Новороссийска. На его берегах находятся населенные пункты, которые образуют зону отдыха Абрау-Дюрсо. Это живописный уголок с великолепной природой, красивыми набережными, ухоженными пляжами и уютными гостиницами. Одно из самых посещаемых туристами мест – завод и дегустационный зал шампанских и игристых вин',
    type: 'Другие виды активного отдыха на открытом воздухе',
  )
];
